class FormValidator {

}



// Экземпляр класса FormValidator создаётся для каждой проверяемой формы.Этот класс должен:
// Принимать в конструктор объект настроек с классами формы;
// Принимать в конструктор ссылку на HTML - элемент проверяемой формы;
// Содержать приватные методы для обработки формы;
// «Содержать публичный метод enableValidation — вызовите его после создания экземпляра класса».


// Каждый класс выполняет строго одну задачу.Всё, что относится к решению этой задачи, находится в классе.
// Ни один другой класс к решению этой задачи не относится.